/* CSSM Error Descriptions. */

/* The key is the CSSM error code, formatted as an unsigned integer, as defined in various header files. */
/* The value is a brief description of the error. */

/* "Standard" error codes defined by the CDSA spec., found in cssmerr.h. */

/* Apple use the private errors as one of their codes... d'oh. */

2147551489 = "An input buffer does not have the expected length";
2147551490 = "An output buffer was supplied, but it was too small to hold the output data";
2147551491 = "The CSP does not support the requested privilege level";
2147551492 = "Indicates that a hardware subsystem has failed in some way";
2147551493 = "Indicates that a hardware subsystem has run out of memory";
2147551494 = "The attach handle used to attempt an operation currently has an operation in progress that will not allow other operations to begin until it completes";
2147551495 = "The operation can not be performed without authenticating using CSSM_CSP_Login";

2147551506 = "The supplied key is invalid or incompatible with the operation";
2147551507 = "The CSSM_KEY contains a reference that does not indicate a key in the CSP";
2147551508 = "The supplied key is not the proper class (i.e. Public key is supplied for a private key operation)";
2147551509 = "The algorithm ID in the key header does not match the algorithm to be performed";
2147551510 = "The key does not have the proper usage flags to perform the operation";
2147551511 = "The key data blob type is not the correct type (i.e. The key is wrapped when a raw key or reference is expected)";
2147551512 = "The key header information is corrupt, or does not match the key data";
2147551513 = "The key format is not supported by the CSP";
2147551514 = "The key size is not supported or not allowed by the current privilege or supported by the CSP";
2147551515 = "The pointer to a CSSM_KEY structure is invalid";
2147551516 = "A requested key usage is not valid for the key type, or two of the uses are not compatible";
2147551517 = "The key usage mask is valid, but not supported by the CSP";
2147551518 = "A requested key attribute is not valid for the key type, or two of the attributes are not compatible";
2147551519 = "The key attribute mask is valid, but not supported by the CSP";
2147551520 = "The label specified for a key is invalid";
2147551521 = "The CSP does not support the use of labels for the key";

2147551528 = "Input vector length is invalid; buffer count can not be zero";
2147551529 = "The CSP only supports input of a single buffer per API call";
2147551530 = "A vector of buffers for input does not contain valid information";
2147551531 = "A vector of buffers for output does not contain valid information";

2147551536 = "The cryptographic context and operation types are not compatible";
2147551537 = "Algorithm is not supported by the CSP";
2147551542 = "The cryptographic key is invalid";
2147551543 = "The cryptographic key is missing";
2147551544 = "The algorithm mode required an initialization vector and it is invalid";
2147551545 = "The algorithm mode required an initialization vector and it is missing";
2147551546 = "The operation requires salt and it is invalid";
2147551547 = "The operation requires salt and it is missing";
2147551548 = "An algorithm mode with padding is specified and the padding type is invalid";
2147551549 = "An algorithm mode with padding is specified and the padding type is missing";
2147551550 = "The operation required random data and it is invalid";
2147551551 = "The operation required random data and it is missing";
2147551552 = "The algorithm requires a seed value and it is invalid";
2147551553 = "The algorithm requires a seed value and it is missing";
2147551554 = "The operation requires a passphrase value and it is invalid";
2147551555 = "The operation requires a passphrase value and it is missing";
2147551556 = "The operation requires a key length and it is invalid";
2147551557 = "The operation requires a key length and it is missing";
2147551558 = "The algorithm has a configurable block size and the value is invalid";
2147551559 = "The algorithm has a configurable block size and the value is missing";
2147551560 = "The application has already started a staged operation using the specified CC";
2147551561 = "An \"Update\" or \"Final\" API has been called without calling the corresponding \"Init\"";
2147551562 = "The signature is not valid";
2147551563 = "The signature data is not in the proper format";
2147551564 = "The size of the output data can not be determined";
2147551565 = "The size of the input is not equal to a multiple of the algorithm block size; valid for symmetric block ciphers in an unpadded mode";
2147551566 = "The private key matching the public key was not found";
2147551567 = "The public key specified does not match the private key being unwrapped";
2147551568 = "The logical device could not be verified by the service provider";
2147551569 = "The login name is not recognized by the CSP";
2147551570 = "The device is already logged in and can not be reauthenticated";
2147551571 = "The private key already exists in the CSP";
2147551572 = "Key label already exists in the CSP";
2147551573 = "The digest algorithm passed in to the Sign/Verify operation is invalid";

2147551588 = "The algorithm has a configurable output size and the value is invalid";
2147551589 = "The algorithm has a configurable output size and the value is missing";
2147551590 = "The algorithm has a configurable number of rounds and the value is invalid";
2147551591 = "The algorithm has a configurable number of rounds and the value is missing";
2147551592 = "The algorithm required a set of parameters and they are invalid";
2147551593 = "The algorithm required a set of parameters and they are missing or invalid.";
2147551594 = "The operation creates an object that requires a label and it is invalid";
2147551595 = "The operation creates an object that requires a label and it is missing";
2147551596 = "The operation requires a key type and the value is invalid";
2147551597 = "The operation requires a key type and the value is missing";
2147551598 = "The algorithm requires a mode to be specified and it is invalid";
2147551599 = "The algorithm requires a mode to be specified and it is missing";
2147551600 = "The algorithm has a configurable number of effective bits and the value is invalid";
2147551601 = "The algorithm has a configurable number of effective bits and the value it missing";
2147551602 = "The operation creates an object with a validity date and the starting date is invalid";
2147551603 = "The operation creates an object with a validity date and the starting date is missing";
2147551604 = "The operation creates an object with a validity date and the ending date is invalid";
2147551605 = "The operation creates an object with a validity date and the ending date is missing";
2147551606 = "The operation requires a version number and the value is invalid";
2147551607 = "The operation requires a version number and the value is missing";
2147551608 = "The operation requires a prime value and it is invalid";
2147551609 = "The operation requires a prime value and it is missing";
2147551610 = "The operation requires a base value and it is invalid";
2147551611 = "The operation requires a base value and it is missing";
2147551612 = "The operation requires a sub-prime value and it is invalid";
2147551613 = "The operation requires a sub-prime value and it is missing";
2147551614 = "The operation has a configurable iteration count and the value is invalid";
2147551615 = "The operation has a configurable iteration count and the value is missing";
2147551616 = "The operation can store new objects in a specific location and the value is invalid";
2147551617 = "The operation can store new objects in a specific location and the value is missing";
2147551618 = "The operation requires access credentials and they are invalid";
2147551619 = "The operation requires access credentials and they are missing";
2147551620 = "The resulting public key format is invalid";
2147551621 = "The resulting public key format is missing";
2147551622 = "The resulting private key format is invalid";
2147551623 = "The resulting private key format is missing";
2147551624 = "The resulting symmetric key format is invalid";
2147551625 = "The resulting symmetric key format is missing";
2147551626 = "The resulting wrapped key format is invalid";
2147551627 = "The resulting wrapped key format is missing";

/* Apple's private CSP errors, defined in cssmapple.h. */

2147552256 = "The user specified the calling application should be added to the relevant item's ACL list";
2147552257 = "Missing algorithm parameter(s)";

/* Apple's private DL errors, defined in cssmapple.h. */

2147554304 = "Pointer does not refer to a valid CSSM_APPLEDL_OPEN_PARAMETERS structure";